from Backend.Utils.Glossary import GlossaryHandler

def build_estate_gellosaries():
    estate_glo_map = {
            'yes': {
                'ٔyes':'ٔدارد',
                'no': 'ندارد'
            },

            'melk-category':{
                '':'--انتخاب کنید--',
                'aparteman':'آپارتمان',
                'land':'زمین',
                'official':'اداری',
                'garden':'باغ',
                'commercial':'تجاری',
                'villa':'ویلایی',

                
            },

            'city':{
                'esf':'اصفهان',
                'shahin':'شاهین شهر',
                
            },

            'yes':{
                'yes':'بله',
                'no':'خیر'
            },

            'have':{
                'have':'دارد',
                'not-have':'ندارد'
            },

            'rebuilding':{
                'بازسازی' : 'بازسازی',
                'صفر' : 'صفر',
                'هیچکدام' : 'هیچکدام',
            },

            'document-status':{
                'تک برگ':'تک برگ',
                'قول نامه‌ای':'قول نامه‌ای',
                'دفترچه‌ای':'دفترچه‌ای',
                'صلحنامه':'صلحنامه',
                'تعاونی':'تعاونی',
                'در دست اقدام':'در دست اقدام',
                'مادر':'مادر',
            },

            'light-direction':{
                'شمالی' : 'شمالی',
                'جنوبی' : 'جنوبی',
                'غربی' : 'غربی',
                'شرقی' : 'شرقی',
                'شمالی - جنوبی' : 'شمالی - جنوبی',
                'شمالی - جنوبی - غربی' : 'شمالی - جنوبی - غربی',
                'شمالی - جنوبی - شرقی' : 'شمالی - جنوبی - شرقی',
                'شرقی - غربی' : 'شرقی - غربی',
                'شمالی - غربی' : 'شمالی - غربی',
                'شمالی - شرقی' : 'شمالی - شرقی',
                'جنوبی - غربی' : 'جنوبی - غربی',
                'جنوبی - شرقی' : 'جنوبی - شرقی',
                'شمالی - جنوبی - شرقی - غربی' : 'شمالی - جنوبی - شرقی - غربی',

            },

            'branch' : {
                'آب' : 'آب',    
                'برق' : 'برق',    
                'گاز' : 'گاز',    

            },

            'parking-status':{
                'مسقف':'مسقف',
            },

            'other-features' : {
                'لابی' : 'لابی',
                'روف گاردن' : 'روف گاردن',
                'سالن اجتماعات' : 'سالن اجتماعات',
                'آنتن مرکزی' : 'آنتن مرکزی',
                'جارو مرکزی' : 'جارو مرکزی',
                'آسانسور باربر' : 'آسانسور باربر',
                'آشپزخانه دوم' : 'آشپزخانه دوم',
                'استخر' : 'استخر',
                'سونا' : 'سونا',
                'جکوزی' : 'جکوزی',
                'خانه هوشمند' : 'خانه هوشمند',
                'فضای سبز' : 'فضای سبز',
                'آلاچیق' : 'آلاچیق',
                'دوربین مداربسته' : 'دوربین مداربسته',
                'نگهبانی' : 'نگهبانی',
        },

            'floor-material' : {
                'سرامیک' : 'سرامیک',
                'سنگ' : 'سنگ',
                'پارکت چوب' : 'پارکت چوب',
                'پارکت لمینت' : 'پارکت لمینت',
                'موکت' : 'موکت',    
                'other' : 'سایر',
        },

            'ceiling-material' : {
                'ساده' : 'ساده',
                'گچ بری' : 'گچ بری',
                'کناف' : 'کناف',
                'نورپردازی' : 'نورپردازی',
                'other' : 'سایر',
            },
            
            'walls-material' : {
                'کاغذ دیواری' : 'کاغذ دیواری',
                'رنگ و نقاشی' : 'رنگ و نقاشی',
                'ترمو وال' : 'ترمو وال',
                'پتینه' : 'پتینه',
                'دیوارکوب' : 'دیوارکوب',
                'سفیده شده' : 'سفیده شده',
                'other' : 'سایر',
            },

            'cabinets-material' : {
                'MDF' : 'MDF',
                'ممبران' : 'ممبران',
                'های گلس' : 'های گلس',
                'پلی گلس' : 'پلی گلس',
                'فلزی' : 'فلزی',
                'چوب' : 'چوب',
                'other' : 'سایر',
            },

            'warming-system' : {
                'بخاری' : 'بخاری',
                'موتور خانه' : 'موتور خانه',
                'رادیاتور - پکیج' : 'رادیاتور - پکیج',
                'اسپیلیت' : 'اسپیلیت',
                'شومینه' : 'شومینه',
                'شومینه مدرن' : 'شومینه مدرن',
                'مرکزی' : 'مرکزی',
                'other' : 'سایر',
            },

            'cooling-system' : {
                'کولر آبی' : 'کولر آبی',
                'اسپیلیت' : 'اسپیلیت',
                'داکت اسپیلیت' : 'داکت اسپیلیت',
                'چیلر' : 'چیلر',
                'مرکزی' : 'مرکزی',
                'other' : 'سایر',
            },

            'kitchen-material' : {
                'مدرن' : 'مدرن',
                'جریزه' : 'جریزه',
                'بسته' : 'بسته',
                'اپن' : 'اپن',
                'هود' : 'هود',
                'گاز رومیزی' : 'گاز رومیزی',
                'other' : 'سایر',    
            },

            'bathroom-material' : {
                'مستر' : 'مستر',    
                'حوله خشک کن' : 'حوله خشک کن',    
                'وان' : 'وان',    
                'جکوزی' : 'جکوزی',    
                'other' : 'سایر',    
            },

            'wc-material' : {
                'ایرانی' : 'ایرانی', 
                'فرنگی' : 'فرنگی',    
                'other' : 'سایر',    
            },

            'door-material' : {
                'ضد سرقت' : 'ضد سرقت',    
                'چوبی' : 'چوبی',    
                'فلزی' : 'فلزی',    
                'سکوریت' : 'سکوریت',    
                'UPVC' : 'UPVC',    
                'آکاردئونی' : 'آکاردئونی',  
                'اتوماتیک' : 'اتوماتیک',    
                'other' : 'سایر',    
            },

            'window-material' : {
                'َUPVC' : 'َUPVC',    
                'دو جداره' : 'دو جداره',    
                'آلمینیومی' : 'آلمینیومی',    
                'فلزی' : 'فلزی',    
                'other' : 'سایر',    
            },

    }

    return GlossaryHandler(estate_glo_map)
